valoni/STM32F103/trunk/DeviceCode/Targets/Native/S3C2416/DeviceCode/2416_reg.h
#define NFCONF_ECC_1BIT		(0<<23)
#define NFCONF_ECC_4BIT		(2<<23)
#define NFCONF_ECC_8BIT		(1<<23)

#define NFCONT_ECC_ENC		(1<<18)
#define NFCONT_WP		(1<<16)
#define NFCONT_MECCLOCK		(1<<7)
#define NFCONT_SECCLOCK		(1<<6)
#define NFCONT_INITMECC		(1<<5)
#define NFCONT_INITSECC		(1<<4)
#define NFCONT_INITECC		(NFCONT_INITMECC | NFCONT_INITSECC)
#define NFCONT_CS_ALT		(1<<1)
#define NFCONT_CS		(1<<1)
#define NFSTAT_ECCENCDONE	(1<<7)
#define NFSTAT_ECCDECDONE	(1<<6)
#define NFSTAT_RnB		(1<<0)
#define NFESTAT0_ECCBUSY	(1<<31)

/*
 * Interrupt
 */
#define ELFIN_INTERRUPT_BASE	0x4a000000

#define INTMSK_OFFSET		0x08
#define INTSUBMSK_OFFSET	0x1c
#define INTMOD_OFFSET		0x04

#define SRCPND_REG		__REG(0x4a000000)
#define INTMOD_REG		__REG(0x4a000004)
#define INTMSK_REG		__REG(0x4a000008)
#define INTPND_REG		__REG(0x4a000010)
#define INTOFFSET_REG		__REG(0x4a000014)
#define SUBSRCPND_REG		__REG(0x4a000018)
#define INTSUBMSK_REG		__REG(0x4a00001C)
#define PRIORITY_MODE_REG	__REG(0x4a000030)
#define PRIORITY_UPDATE_REG	__REG(0x4a000034)
#define SRCPND2_REG			__REG(0x4a000040)
#define INTMOD2_REG			__REG(0x4a000044)
#define INTMSK2_REG 			__REG(0X4A000048)
#define INTPND2 				__REG(0X4A000050)
#define INTOFFSET2 			__REG(0X4A000054)
#define PRIORITY_MODE2 		__REG(0x4A000070)
#define PRIORITY_UPDATE2 	__REG(0x4A000074)

/*
 * LCD Controller
 */
#define ELFIN_LCD_BASE	0x4c800000

#define VIDCON0		(0x4c800000)
#define VIDCON1		(0x4c800004)
#define VIDTCON0	(0x4c800008)
#define VIDTCON1	(0x4c80000C)
#define VIDTCON2	(0x4c800010)
#define WINCON0		(0x4c800014)
#define WINCON1		(0x4c800018)
#define VIDOSD0A	(0x4c800028)
#define VIDOSD0B	(0x4c80002C)
#define VIDOSD0C	(0x4c800030)
#define VIDOSD1A	(0x4c800034)
#define VIDOSD1B	(0x4c800038)
#define VIDOSD1C	(0x4c80003C)
#define VIDW00ADD0B0	(0x4c800064)
#define VIDW00ADD0B1	(0x4c800068)
#define VIDW01ADD0	(0x4c80006C)
#define VIDW00ADD1B0	(0x4c80007C)
#define VIDW00ADD1B1	(0x4c800080)
#define VIDW01ADD1	(0x4c800084)
#define VIDW00ADD2B0	(0x4c800094)
#define VIDW00ADD2B1	(0x4c800098)
#define VIDW01ADD2	(0x4c80009C)
#define VIDINTCON	(0x4c8000AC)
#define W1KEYCON0	(0x4c8000B0)
#define W1KEYCON1	(0x4c8000B4)
#define W2KEYCON0	(0x4c8000B8)
#define W2KEYCON1	(0x4c8000BC)
#define W3KEYCON0	(0x4c8000C0)
#define W3KEYCON1	(0x4c8000C4)
#define W4KEYCON0	(0x4c8000C8)
#define W4KEYCON1	(0x4c8000CC)
#define WIN0MAP		(0x4c8000D0)
#define WIN1MAP		(0x4c8000D4)
#define WPALCON		(0x4c8000E4)
#define SYSIFCON0	(0x4c800130)
#define SYSIFCON1	(0x4c800134)
#define DITHMODE1	(0x4c800138)
#define SIFCCON0	(0x4c80013C)
#define SIFCCON1	(0x4c800140)
#define SIFCCON2	(0x4c800144)
#define CPUTRIGCON1	(0x4c80015C)
#define CPUTRIGCON2	(0x4c800160)
#define VIDW00ADD0B1	(0x4c800068)
#define VIDW01ADD0	(0x4c80006C)
//ZhangGQ add 20130401
#define VIDCON0_REG		__REG(0x4c800000)
#define VIDCON1_REG		__REG(0x4c800004)
#define VIDTCON0_REG	__REG(0x4c800008)
#define VIDTCON1_REG	__REG(0x4c80000C)
#define VIDTCON2_REG	__REG(0x4c800010)
#define WINCON0_REG		__REG(0x4c800014)
#define WINCON1_REG		__REG(0x4c800018)
#define VIDOSD0A_REG	__REG(0x4c800028)
#define VIDOSD0B_REG	__REG(0x4c80002C)
#define VIDOSD0C_REG	__REG(0x4c800030)
#define VIDOSD1A_REG	__REG(0x4c800034)
#define VIDOSD1B_REG	__REG(0x4c800038)
#define VIDOSD1C_REG	__REG(0x4c80003C)
#define VIDW00ADD0B0_REG	__REG(0x4c800064)
#define VIDW00ADD0B1_REG	__REG(0x4c800068)
#define VIDW01ADD0_REG		__REG(0x4c80006C)
#define VIDW00ADD1B0_REG	__REG(0x4c80007C)
#define VIDW00ADD1B1_REG	__REG(0x4c800080)
#define VIDW01ADD1_REG		__REG(0x4c800084)
#define VIDW00ADD2B0_REG	__REG(0x4c800094)
#define VIDW00ADD2B1_REG	__REG(0x4c800098)
#define VIDW01ADD2_REG	__REG(0x4c80009C)
#define VIDINTCON_REG	__REG(0x4c8000AC)
#define W1KEYCON0_REG	__REG(0x4c8000B0)
#define W1KEYCON1_REG	__REG(0x4c8000B4)
#define W2KEYCON0_REG	__REG(0x4c8000B8)
#define W2KEYCON1_REG	__REG(0x4c8000BC)
#define W3KEYCON0_REG	__REG(0x4c8000C0)
#define W3KEYCON1_REG	__REG(0x4c8000C4)
#define W4KEYCON0_REG	__REG(0x4c8000C8)
#define W4KEYCON1_REG	__REG(0x4c8000CC)
#define WIN0MAP_REG		__REG(0x4c8000D0)
#define WIN1MAP_REG		__REG(0x4c8000D4)
#define WPALCON_REG		__REG(0x4c8000E4)
#define SYSIFCON0_REG	__REG(0x4c800130)
#define SYSIFCON1_REG	__REG(0x4c800134)
#define DITHMODE1_REG	__REG(0x4c800138)
#define SIFCCON0_REG	__REG(0x4c80013C)
#define SIFCCON1_REG	__REG(0x4c800140)
#define SIFCCON2_REG	__REG(0x4c800144)
#define CPUTRIGCON1_REG	__REG(0x4c80015C)
#define CPUTRIGCON2_REG	__REG(0x4c800160)
#define VIDW00ADD0B1_REG	__REG(0x4c800068)
#define VIDW01ADD0_REG	__REG(0x4c80006C)

//* VIDCON0	
#define VIDCON0_S_RGB_IF					(0<<22)
#define VIDCON0_S_CPU_IF_MAIN				(2<<22)
#define VIDCON0_S_CPU_IF_SUB				(3<<22)

#define VIDCON0_CPU_16BIT					(0<<19)
#define VIDCON0_CPU_16plus2					(1<<19)
#define VIDCON0_CPU_9plus9					(2<<19)
#define VIDCON0_CPU_16plus8					(3<<19)
#define VIDCON0_CPU_18BIT					(4<<19)

#define VIDCON0_S_RGB_PAR					(0<<13)
#define VIDCON0_S_BGR_PAR					(1<<13)
#define VIDCON0_S_RGB_SER					(2<<13)
#define VIDCON0_S_BGR_SER					(3<<13)
#define VIDCON0_S_CLKVAL_F_AlWAYS_UPDATE	(0<<12)
#define VIDCON0_S_CLKVAL_F_SOF_UPDATE		(1<<12)
#define VIDCON0_S_VCLK_GATING_ON			(0<<5)
#define VIDCON0_S_VCLK_GATING_OFF			(1<<5)
#define VIDCON0_S_CLKDIR_DIRECT				(0<<4)
#define VIDCON0_S_CLKDIR_DIVIDED			(1<<4)
#define VIDCON0_S_CLKSEL_HCLK				(0<<2)
#define VIDCON0_S_CLKSEL_EPLL				(1<<2)
#define VIDCON0_S_ENVID_OFF					(0<<1)
#define VIDCON0_S_EVVID_ON					(1<<1)
#define VIDCON0_S_ENVID_F_OFF				(0<<0)
#define VIDCON0_S_ENVID_F_ON				(1<<0)
//bit shift
#define VIDCON0_CLKVAL_F_SHIFT				(6)

//* VIDCON1
#define VIDCON1_S_VCLK_FALL_EDGE_FETCH		(0<<7)
#define VIDCON1_S_VCLK_RISE_EDGE_FETCH		(1<<7)
#define VIDCON1_S_HSYNC_INVERTED			(1<<6)
#define VIDCON1_S_VSYNC_INVERTED			(1<<5)
#define VIDCON1_S_VDEN_INVERTED				(1<<4)

//* VIDTCON0,1
//bit shift
#define VIDTCON0_BPD_S				(16)
#define VIDTCON0_FPD_S				(8)
#define VIDTCON0_SPW_S				(0)

//* VIDTCON2
//bit shift
#define VIDTCON2_LINEVAL_S			(11)
#define VIDTCON2_HOZVAL_S			(0)


//* WINCON1to4
#define WINCONx_BIT_SWAP_ON			(1<<2)	//shift on basis of half-word swap
#define WINCONx_BYTE_SWAP_ON		(1<<1)	//shift on basis of half-word swap
#define WINCONx_HALFW_SWAP_ON		(1<<0)	//shift on basis of half-word swap
#define WINCONx_4WORD_BURST			(2)
#define WINCONx_8WORD_BURST			(1)
#define WINCONx_16WORD_BURST		(0)
#define WINCONx_PLANE_BLENDING		(0)
#define WINCONx_PIXEL_BLENDING		(1)
#define WINCONx_1BPP_PALLET			(0)
#define WINCONx_2BPP_PALLET			(1)
#define WINCONx_4BPP_PALLET			(2)
#define WINCONx_8BPP_PALLET			(3)
#define WINCONx_8BPP_NO_PALLET		(4)
#define WINCONx_16BPP_565			(5)
#define WINCONx_16BPP_A555			(6)
#define WINCONx_16BPP_1555			(7)
#define WINCONx_18BPP_666			(8)
#define WINCONx_18BPP_A665			(9)
#define WINCONx_19BPP_A666			(10)
#define WINCONx_24BPP_888			(11)
#define WINCONx_24BPP_A887			(12)
#define WINCONx_25BPP_A888			(13)
#define WINCONx_ALPHA_MODE_0		(0)
#define WINCONx_ALPHA_MODE_1		(1)

